posts/nep-critique/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-18 Sun 14:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>/nebhrajani/posts/nep-critique/</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nebhrajani A.V." />
<html class="sea-theme">
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" href="../../stylesheets/hack.css" />
<link rel="stylesheet" href="../../stylesheets/css.css" />
<link rel="stylesheet" href="../../stylesheets/standard.css" />
<link rel="stylesheet" href="../../stylesheets/index.css" />
</head>
<body>
<div id="content">
<nav class="sidebar-nav">
<a class="nav-item" title="" href="https://nebhrajani-a.github.io/">home</a>
<a class="nav-item" title="" href="https://nebhrajani-a.github.io/posts/">posts</a>
<a class="nav-item" title="" href="https://nebhrajani-a.github.io/files/">files</a>
</nav>

<h1 id="title">A Critique of India's NEP 2020</h1>
<div class="post-meta"> <2020-08-20 Fri> - 5 min read
</div>

<p>
I'd written this article as an Instagram story, which I'm re-posting
due to its popularity.
</p>

<div id="outline-container-orge091abe" class="outline-2">
<h2 id="orge091abe"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
I'll say this outright: I'm not for the measures taken by the
educational reform. Hear me out.
</p>

<p>
The changes in the system are quite clearly mimicking the educational
systems abroad, and in particular, that of the USA. The divisions
between preschool, elementary, middle, and high, along with the
combined entrance test for colleges is the same. Moreover, the way
boards are being removed and syllabus cut for ECs is quite clearly
another copied system.
</p>

<p>
However, when we mimic a system, we inherit not only its virtues but
its flaws as well. It's necessary that we analyse these impartially
before jumping to conclusions.
</p>
</div>
</div>


<div id="outline-container-org8654f0b" class="outline-2">
<h2 id="org8654f0b"><span class="section-number-2">2</span> Easier Isn't Necessarily Better</h2>
<div class="outline-text-2" id="text-2">
<p>
I've heard a lot of complaints against the Indian education system.
How it's too science focused, has streams, does not cultivate a
creative environment, and puts pressure. However, what the Indian
system does do well, better than any other education system in the
world, is have rigorous education. We do each thing ten times till we
learn it. We dive deep into the subject matter. Our rigour and depth
in subjects is precisely what sets Indians apart: there is good reason
Indian-educated Indians are leading Silicon Valley, and it's this very
rigour and way of doing things. To anybody who disagrees, compare the
difficulty of the APs of the USA and the JEE. While we're not perfect,
we are doing pure education better than the West, and that makes us a
formidable country. What the USA does do better than us is college
education, from undergraduates through post grads. If anything, we
should aim to mimic those.
</p>
</div>
</div>


<div id="outline-container-orgaa2ce95" class="outline-2">
<h2 id="orgaa2ce95"><span class="section-number-2">3</span> Streams Are A Good Thing</h2>
<div class="outline-text-2" id="text-3">
<p>
It is common knowledge that it's good to specialise early. More and
more colleges offer increasing levels of specialisation even at
undergrad levels, because the less time you spend studying irrelevant
stuff, the better. The harsh truth is, one simply cannot
simultaneously be an engineer and a psychologist: you have to
specialise, and become an expert in the field.
</p>

<p>
The concept of streams allows exactly this, in fact, it enforces a
specialisation early, making young adults explore career paths early
on, giving us an edge.
</p>

<p>
By being lax about streams, we drag the paradoxes of consumerism to
education: too many choices.
</p>
</div>
</div>


<div id="outline-container-orgee3a0a3" class="outline-2">
<h2 id="orgee3a0a3"><span class="section-number-2">4</span> The Cold Never Bothered Me Anyway</h2>
<div class="outline-text-2" id="text-4">
<p>
People who go deep into fields understand the value of being able to
deal with pressure (an experience boards gives us), the need for
rigour (what our current system is based upon), and the need for
specialisation.
</p>

<p>
Sure, these things seem annoyances in the short term, but the true
value is recognised when professional work is being done in the field
and an Indian comes up with an elegant solution as a result of years
of practice. The cold we felt doesn't bother us any more: we embrace
it.
</p>

<p>
Until you embrace this harsh reality, you will forever wish that
things be easier for us, when we should be begging, for our sake and
that of this nation, for more complex syllabus.
</p>

<p>
The system we're shifting to, meanwhile, is geared towards making
education ‘fun' and ‘exciting', which are both, brutally honestly,
shallow short term dreams. Any subject becomes fun when you dive deep
into it, is learning the alphabet expected to be fun, or is reading
Harry Potter? The shift to an education system like that of the West
will mean we surrender our single biggest advantage as a developing
nation: knowing subjects more deeply than our Western counterparts
studying less rigorous curriculums. For all the jokes about Indians
aping the British by wearing suits, we still are mimicking the West,
despite our own model already being successful.
</p>
</div>
</div>


<div id="outline-container-org1ead160" class="outline-2">
<h2 id="org1ead160"><span class="section-number-2">5</span> Difficulty, Time, And Coding</h2>
<div class="outline-text-2" id="text-5">
<p>
The reform is obviously making the system less difficult and spending
more time on things like ‘coding'. I laughed when I saw coding up
there. If anybody has tried to study programming, they know that the
basis is pure mathematics of the highest level. How can you teach 12
year olds concepts that they don't have the tools to? In fact, the IP
syllabus we have for 11-12th is pathetically basic (~algos, recursion)
what are we going to teach 6th graders? (In fact, the software we use
to teach in all but one state is proprietary Microsoft, rather than
our native Indian CDAC's BOSS Linux distro.) This is a clear case of
building castles in the air: saying that we teach AI sounds
better than saying we teach math for 10 years: but, it's the latter
that brings true understanding.
</p>
</div>
</div>


<div id="outline-container-org1b73d73" class="outline-2">
<h2 id="org1b73d73"><span class="section-number-2">6</span> Nationalism</h2>
<div class="outline-text-2" id="text-6">
<p>
If you're truly patriotic and an Indian, will you stand by a reform
that cripples the children going through it? That will never teach
them to deal with pressure, that will trick them into thinking they
are competent when they are not, a system, in essence, that encourages
mediocrity and takes away from India's youth the one thing we have:
excellence and common sense in a fine blend, even though we may not
have the resources of the West.
</p>


<p>
Take away the rigour, take away our essence, make us clones of what
the West produces, and what are we left with? A youth that is
unemployable, because they've never been tested, never faced pressure,
and never found the beauty that lies in the thin margin note of an old
textbook from 1892.
</p>
</div>
</div>


<div id="outline-container-org3b1e26e" class="outline-2">
<h2 id="org3b1e26e"><span class="section-number-2">7</span> Conclusion</h2>
<div class="outline-text-2" id="text-7">
<p>
I won't comment on the political angle, that of making a big move
right before elections that the public will like. It isn't my place to
do so, I am neither an expert nor an active follower of politics. What
I will say, however, is that you can read this. You know, inside you,
that making education easier isn't how we're going to succeed as a
nation. Doing things the long hard way sucks, but ultimately, someone
has to do it. And if we don't, the only two countries left doing
anything rigorous will be Russia and China; and that's one road I
really don't want to go down. If you feel pride in a fellow Indian's
achievement, seeing Pichai on stage and Mangalyaan on the Moon, you
should already know by now: making things easier isn't the way to go.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr><p style="font-size: 75%">Created in GNU <a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="https://orgmode.org">Org</a> mode 9.3.6).</p>
</div>
</body>
</html>
